<?php
return array(
		//服务器系统编码
		'SERVER_OSCODE'=>array('All'=>array('0'=>"ASCII",'UTF-8','GB2312',"GBK",'BIG5','shift-jis'),'Current'=>'shift-jis'),
		//入园基本信息
		'BASE_INFO'=>array(
							'Kindergarden_Info'=>Model::factory('master')->getKindergardenName(),
							'Recog_Type'=>array('R1'=>'1号認定','R2'=>'2号標準','R2S'=> '2号時短','R3'=> '3号標準', 'R3S'=> '3号時短'),
							//'CLASS'=>array('C1'=> 'めだか(0歳)','C2'=>'ひよこ(1歳)','C3'=>'うさぎ(2歳)','C4'=>'れんげ(満3歳)','C5'=>'さくら(3歳)','C6'=>'たんぽぽ(4歳)','C7'=>'すみれ(5歳)'),
							'CLASS'=>Model::factory('master')->getEffectiveClass(),
							'CLASSForActivities'=>Model::factory('master')->getEffectiveClassForActivities(),
							'BloodType'=>array('A'=>'A','B'=>'B','O'=>'O','AB'=>'AB','Other'=>'その他')
							),
		
		//上学交通
		'TRAFFIC'=>array(
							'Traffic_Way'=>array('Bus'=>'園バス','Walk'=>'徒歩','Other'=>'その他'),
							'Traffic_TakeTime'=>array('5分','10分','15分','20分','25分','30分','35分','40分','45分','50分','55分','60分','65分','70分','75分','80分','85分'	,'90分','95分','100分'),
							'Traffic_Distance'=>array('50m','100m','200m','300m','400m','500m','800m','1Km','1.5km','2km','2.5km','3km','3.5km','4km','4.5km','5km','6km','7km','8km','9km','10km','15km','20km','25km','30km','40km','50km','60km','70km','80km')			
							),
		
		//到达和离开时间
		'ARRIVE_LEAVE'=>array(
								'Arrive_Time'=>array('startTime'=>'7:30','endTime'=>'14:00','interval'=>'600'),
								'Leave_Time'=>array('startTime'=>'13:00','endTime'=>'19:30','interval'=>'600')
							),
							
		//成员关系
		'RELATIONSHIP'=>array('Mom'=>'母','Father'=>'父','GM'=>'祖母','GF'=>'祖父','Old_Bro'=>'兄'
							,'Old_Sister'=>'姉','Lit_Bro'=>'弟','Lit_Sister'=>'妹','Other'=>'その他'
							),
		
		//迎え
		'WITH'=>array('Mom'=>'母','Father'=>'父','GM'=>'祖母','GF'=>'祖父','Old_Bro'=>'兄'
							,'Old_Sister'=>'姉','Uncle'=>'叔父','Aunt'=>'叔母','Bus'=>'バス','Other'=>'その他','yes'=>''	
					),
		
		//监护人休息日
		'GUARDIAN_RESTDAY'=>array('Mon'=>'月曜日','Tues'=>'火曜日','Wed'=>'水曜日','Thur'=>'木曜日'
								,'Fri'=>'金曜日','Sat'=>'土曜日','Sun'=>'日曜日','Holiday'=>'土日祝','Other'=>'その他'
							),
		
		//生产信息
		'BIRTH'=>array(
						'Birth_Period'=>array('Normal'=>'ふつう','Early'=>'早産','Late'=>'遅かった','Other'=>'その他'),
						'Birth_Status'=>array('Normal'=>'ふつう','Soft'=>'軽かった','Hard'=>'難産','Operative'=>'手術分娩')
						),
		
		//哺乳信息				
		'SUCKLE'=>array(
						'Suckle_Status'=>array('Ing'=>'授乳中','Away'=>'離乳'),
						'Suckle_Way'=>array('ByMom'=>'母乳のみ','ByOther'=>'人工栄養のみ','ByMomAndOther'=>'母乳と人工栄養')
						),
		
		//年岁				
		'AGE'=>array(
					'AgeY'=>array('0','1','2','3','4','5'),
					'AgeM'=>array('0','1','2','3','4','5','6','7','8','9','10','11')
		),
		
		//走路情况
		'WALK_STATUS'=>array('Yes'=>'ひとりあるき可','No'=>'不可'),
		
		//讲话语言情况
		'LANGUAGE_STATUS'=>array('Yes'=>'しゃべれる','No'=>'しゃべれない'),
		
		//零食时间
		'EAT_SNACKS_TIME'=>array('startTime'=>'9:30','endTime'=>'18:00','interval'=>'1800'),
		
		//小便
		'TOILET_SMALL_PERIOD'=>array('1'=>'10','20','30','40','50','60'),
		
		//白天睡眠时间
		'SLEEP_DAYTIME_SPEND'=>array('1'=>'20','30','40','50','60','90','120','150','180'),
		
	
		//看电视时间
		'TV_TIME'=>array('1'=>'10','20','30','40','50','60','70','80','90','100','110','120','130','140'
						,'150','160','170','180','190','200','210','220','230','240'
						,'250','260','270','280','290','300'
			),

		//订餐吃饭
		'EAT'=>array('いる','いらない'),		

		'siblingOrder' => array('1'=>'第１子','2'=>'第２子','3'=>'第３子','4'=>'第４子','5'=>'第５子'),

		//星期
		'WEEK'=>array('Mon'=>'月曜日','Tue'=>'火曜日','Wed'=>'水曜日','Thu'=>'木曜日'
								,'Fri'=>'金曜日','Sat'=>'土曜日','Sun'=>'日曜日','None'=>'なし'),
		//星期对应列表
		'WEEK_JP'=>array("日","月","火","水","木","金","土"),
		
		//6月24号追加 ：不等号
		'EQUAL'=>array('up'=>'以上','below'=>'以下','UnEnough'=>'未満','equal'=>'イコール'),
		
		//1号认定项目名称  No.35 (标示号R1)
		'RECOG_1'=>array('1'=>'1号-1','1号-2','1号-3','1号-4','1号-5','1号-6','1号-7','1号-8','1号-9','1号-10','1号-11','1号-12','1号-13','1号-14'),		
		
		//6月24号：2，3认定项目代号
		'PROJECT'=>array('1'=>'A','B','C1','C2','C3','C4','C5','C6','C7','C8','C9','C10','C11','C12','C13','C14','C15','C16','C17'),
		
		//6月24号追加：四舍五入
		'ROUND'=>array('Abandon'=>'切捨て','Up'=>'切上げ','Equal'=>'イコール'),
		
		//2017-02-09:体温选择表示
		'BODY_TEMPERATURE'=>Public_Times::getBodyTemp(35, 40),
		
		//2017-02-20:2-5 延长保育 ：点検事項
		'CHECK_POINT'=>array('1'=>'沐浴室','電気','エアコン','水道','配膳室','カーペット','ベープ','扇風機','戸締り'),
		
		//请求书基本项目
		'INVOICE_PROJECTS'=>array('1'=>'建物維持管理費','行事費','教材費','保護者会費','絵本代','保険代','給食費(月額)','バス代(往復月額)','バス代(片道月額)'),
		
		
		/*
		 * 1号認定
		* 預かり保育：7：30～8：30, 14：00～18：30において該当する時間数
		* ただし「課外活動」に✔が入っている場合は、14:00～15:00の1時間は「預かり保育」の時間に加算しない。
		* 
		* 教育時間：9：30～13:30において該当する時間数。ただし「長期休暇」に✔が入っている場合は、0：00時間とする。
		* 
		* 延長保育：18：30～19：30において該当する時間数。
		* 
		* 補助金対象：7：30～9：30, 13：30～18：30において該当する時間数。
		*/
		'R1_TIMES' => array(
			'DELAYED_TIMES'=>array(array('07:30:00','08:30:00'),array('14:00:00','15:00:00','18:30:00')),
			'STUDY_TIMES'=>array('09:30:00','13:30:00'),
			'EXTENSION_TIMES'=>array('18:30:00','19:30:00'),
			'GRANTS_TIMES'=>array(array('07:30:00','09:30:00'),array('13:30:00','18:30:00')),
			'DELAYED_TIMES_WEEKEND'=>array('07:30:00','18:30:00')			
		),
		
		/*
		 * 2号標準
		 * 通常保育：7：30～18：30において該当する時間数。		 * 
		 * ただし「課外活動」に✔が入っている場合は、14:00～15:00の1時間は「通常保育」の時間に加算しない。
		 * 
		 * 延長保育：18：30～19：30において該当する時間数。
		 * 
		 * 所定保育時間： 「通常保育」＋「延長保育」
		 */
		'R2_TIMES' => array(
				'USUALLY_TIMES'=>array('07:30:00','14:00:00','15:00:00','18:30:00'),
				'EXTENSION_TIMES'=>array('18:30:00','19:30:00')
		),
		
		/*
		 * 2号時短
		 *預かり保育：7：30～9：00, 17：00～18：30において該当する時間数。
		 *
		 *通常保育：9：00～17：00において該当する時間数。
		 *ただし「課外活動」に✔が入っている場合は、14:00～15:00の1時間は「通常保育」の時間に加算しない。
		 *
		 *延長保育：18：30～19：30において該当する時間数。
		 *
		 *所定保育時間： 「預かり保育」＋「通常保育」＋「延長保育」
		 */
		'R2S_TIMES' => array(
				'DELAYED_TIMES'=>array(array('07:30:00','09:00:00'),array('17:00:00','18:30:00')),
				'USUALLY_TIMES'=>array('09:00:00','14:00:00','15:00:00','17:00:00'),
				'EXTENSION_TIMES'=>array('18:30:00','19:30:00')
		),
		
		/*
		 * 3号標準 
		 * 通常保育：7：30～18：30において該当する時間数。
		 * 
		 * 延長保育：18：30～19：30において該当する時間数。
		 * 
		 * 所定保育時間： 「通常保育」＋「延長保育」 
		 */
		'R3_TIMES' => array(
				'USUALLY_TIMES'=>array('07:30:00','18:30:00'),
				'EXTENSION_TIMES'=>array('18:30:00','19:30:00')
		),
		
		/*
		 * 3号時短
		 * 預かり保育：7：30～9：00, 17：00～18：30において該当する時間数。
		 * 
		 * 通常保育：9：00～17：00において該当する時間数。
		 * 
		 * 延長保育：18：30～19：30において該当する時間数。
		 * 
		 * 所定保育時間： 「預かり保育」＋「通常保育」＋「延長保育」 
		 */
		'R3S_TIMES' => array(
				'DELAYED_TIMES'=>array(array('07:30:00','09:00:00'),array('17:00:00','18:30:00')),
				'USUALLY_TIMES'=>array('09:00:00','17:00:00'),
				'EXTENSION_TIMES'=>array('18:30:00','19:30:00')
		),
		
		'EDIT_CHANGE' => array(
				'new'=>'新規登録',
				'Step1_Base'=>'園児情報の変更', 'Step2'=>'保護者情報の変更', 'Step3_Status'=>'入園前の状況の変更',
				'Step3_Vaccine'=>'予防接種の変更', 'Step4_Health'=>'健康の状況の変更',  'Step5_Live'=>'生活の状況の変更',
				'Step5_Edu'=>'入園前の教育状況の変更','Step6'=>'園に対する希望の変更',
				'Family_Add'=>'家族の追加','Family_Less'=>'家族の削除','Family_Change'=>'家族の変更'
		),
		//list/listExtension    Go_With选择框
		'CHOICE'=>array('yes'=>'〇','no'=>'×'),
		
);